brunomarchioro/ambient-calendar/firmware/esp32-c6/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_ALERTS_WIFI_SSID="YOUR_SSID"
CONFIG_ALERTS_WIFI_PASSWORD="YOUR_PASSWORD"
CONFIG_ALERTS_API_BASE_URL="https://example.invalid"
CONFIG_ALERTS_DEVICE_API_TOKEN="replace-me"
CONFIG_ALERTS_POLL_INTERVAL_S=300
CONFIG_ALERTS_HEAP_FLOOR_KB=40
CONFIG_ALERTS_LVGL_DRAW_LINES=20
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
